In [1]:
import numpy as np  #linear algebra
import pandas as pd  #data processing

dataku = pd.DataFrame([[np.nan, 2, np.nan, 0],
                      [3, 4, 'Andre', 1], 
                       [np.nan, np.nan, np.nan, 5],
                       [3, 4, np.nan, 1], 
                      [3, 4, 0, 1]],
                     columns=list('ABCD'))
dataku

     A    B      C  D
0  NaN  2.0    NaN  0
1  3.0  4.0  Andre  1
2  NaN  NaN    NaN  5
3  3.0  4.0    NaN  1
4  3.0  4.0      0  1

In [2]:
dataku.iloc[1]

A        3
B        4
C    Andre
D        1
Name: 1, dtype: object

In [3]:
dataku.iloc[2]

A    NaN
B    NaN
C    NaN
D      5
Name: 2, dtype: object

In [4]:
dataku.iloc[:4]

     A    B      C  D
0  NaN  2.0    NaN  0
1  3.0  4.0  Andre  1
2  NaN  NaN    NaN  5
3  3.0  4.0    NaN  1

In [5]:
dataku.loc[1]

A        3
B        4
C    Andre
D        1
Name: 1, dtype: object

In [6]:
dLoc = pd.DataFrame([['wali', 2, np.nan, 0],
                      ['johan', 4, 'Andre', 1], 
                       ['gilang', np.nan, np.nan, 5],
                       ['latif', 4, np.nan, 1], 
                      ['nasrul', 4, 0, 1]],
                     columns=list('ABCD'))

In [7]:
dLoc

        A    B      C  D
0    wali  2.0    NaN  0
1   johan  4.0  Andre  1
2  gilang  NaN    NaN  5
3   latif  4.0    NaN  1
4  nasrul  4.0      0  1

In [8]:
dLoc.set_index("A", inplace=True)
dLoc.head()

          B      C  D
A
wali    2.0    NaN  0
johan   4.0  Andre  1
gilang  NaN    NaN  5
latif   4.0    NaN  1
nasrul  4.0      0  1

In [9]:
dLoc.loc["johan"]

B        4
C    Andre
D        1
Name: johan, dtype: object

In [12]:
dataku.dropna(axis=1, how='all') #hapus jika ada semua item di dalam kolom tersebut

     A    B      C  D
0  NaN  2.0    NaN  0
1  3.0  4.0  Andre  1
2  NaN  NaN    NaN  5
3  3.0  4.0    NaN  1
4  3.0  4.0      0  1

In [17]:
droptes=dataku.dropna(axis=1, how="any")

In [18]:
droptes

   D
0  0
1  1
2  5
3  1
4  1

In [19]:
trestest=dataku.dropna(thresh=2)

In [20]:
trestest

     A    B      C  D
0  NaN  2.0    NaN  0
1  3.0  4.0  Andre  1
3  3.0  4.0    NaN  1
4  3.0  4.0      0  1

In [22]:
other=dataku.dropna(axis=1, subset=[1])

In [23]:
other

     A    B      C  D
0  NaN  2.0    NaN  0
1  3.0  4.0  Andre  1
2  NaN  NaN    NaN  5
3  3.0  4.0    NaN  1
4  3.0  4.0      0  1